

<div class="ktrx-about-block">

    <h2>Что такое Kitrix</h2>

    <p>
        Kitrix - это программный комплекс позволяющий быстро и удобно
        реализовать плагины под Битрикс, используя популярную методология MVC.
        Kitrix это “обертка” над системой управления Битрикс, а не модуль
        подключаемый через стандартный интерфейс cms. Так как Kitrix работает над cms,
        он легко может манипулировать ядром Битрикс на лету, используя официальные хуки.
    </p>

    <h3>Kitrix - это менеджер модулей</h3>
    <p>На Kitrix вы можете с легкостью (в отличии от модулей Bitrix):</p>
    <ul>
        <li>создать свой плагин (psr-4 autoloading, composer)</li>
        <li>добавить свои админ страницы (mvc)</li>
        <li>управлять роутингом на уровне плагина (wildcard, default params, etc..)</li>
        <li>
            Kitrix автоматически создаст для ваших страниц пункты в админ. меню.
            По желанию вы можете поменять им название и установить иконку из Font Awesome
        </li>
        <li>
            вы можете использовать API других Kitrix плагинов в своих целях,
            к примеру с помощью плагина Kitrix\Config можно за минуту
            вынести все настройки вашего плагина в админ панель
            (все настройки Kitrix плагинов располагаются в одном месте,
            централизованно в отличии от хаоса который творится в битриксе)
        </li>
        <li>
            Kitrix позволяет вам добавлять свои ассеты (css,js)
            достаточно положить их в папку public (внутри вашего плагина)
        </li>
    </ul>

    <h3>Kitrix - это Open Source проект.</h3>
    <p>
        Мы предлагаем всем разработчикам которым надоело кусать кактус, участвовать
        в разработке Kitrix. В наших силах сделать Битрикс удобной и
        современной платформой для разработки проектов.
    </p>

    <p>
        <a href="https://github.com/kitrix-org/core" target="_blank">https://github.com/kitrix-org/core</a>
        <br />Konstantin <<a href="mailto:fe3dback@yandex.ru">fe3dback@yandex.ru</a>>
    </p>

</div>